In [2]:
import pandas as pd
import numpy as np

In [144]:
#load data from local folder

basics_local='Data/title_basics_filtered.csv.gz'
ratings_local='Data/title_ratings_filtered.csv.gz'
tmdb_data_local='Data/tmdb_results_combined.csv.gz'

In [145]:
basics = pd.read_csv(basics_local)

In [146]:
ratings = pd.read_csv(ratings_local)

In [149]:
tmdb_data = pd.read_csv(tmdb_data_local)

In [7]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0094859,movie,Chief Zabu,Chief Zabu,0,2016.0,NaN,74,Comedy

In [8]:
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1905
1  tt0000002            5.8       256
2  tt0000003            6.5      1703
3  tt0000004            5.6       168
4  tt0000005            6.2      2518

In [150]:
tmdb_data.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,False,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,False,5.500,22.0,NaN
2,tt0113092,False,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,False,5.100,8.0,NaN
3,tt0116391,False,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,False,0.000,0.0,NaN
4,tt0118694,False,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,False,8.103,1948.0,PG

In [10]:
basics.shape

(82213, 9)

In [11]:
ratings.shape

(1255994, 3)

In [35]:
aka.shape

(1343796, 8)

## Create title_genres and genres tables

In [126]:
title_genres=basics[['tconst','genres']]

In [127]:
title_genres['genres']=title_genres['genres'].str.split(',')

C:\Users\JoseH\AppData\Local\Temp\ipykernel_6456\1678230004.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  title_genres['genres']=title_genres['genres'].str.split(',')

In [128]:
title_genres = title_genres.explode('genres')
title_genres = title_genres.rename(columns = {'genres':'genre_id'})
title_genres.head()

      tconst genre_id
0  tt0035423   Comedy
0  tt0035423  Fantasy
0  tt0035423  Romance
1  tt0062336    Drama
2  tt0069049    Drama

In [130]:
genres_unique = title_genres['genre_id'].dropna().unique()
genres=pd.DataFrame(genres_unique,columns=['genre_name'])
genres.reset_index(inplace=True)
genres = genres.rename(columns = {'index':'genre_id'})

   genre_id genre_name
0         0     Comedy
1         1    Fantasy
2         2    Romance
3         3      Drama
4         4     Horror
5         5     Sci-Fi
6         6    Mystery
7         7    Musical

In [131]:
t_array = genres["genre_id"].to_numpy()

for f, b in zip(genres_unique, t_array):
    title_genres["genre_id"]=  title_genres["genre_id"].replace(f,str(b))

In [134]:
title_genres.head(8)

      tconst genre_id
0  tt0035423        0
0  tt0035423        1
0  tt0035423        2
1  tt0062336        3
2  tt0069049        3
3  tt0088751        0
3  tt0088751        4
3  tt0088751        5

In [137]:
genres.head(8)

   genre_id genre_name
0         0     Comedy
1         1    Fantasy
2         2    Romance
3         3      Drama
4         4     Horror
5         5     Sci-Fi
6         6    Mystery
7         7    Musical

## Editing the rest of the tables

title_basics

title_ratings

tmdb_data

In [140]:
title_basics=basics.drop(columns=['originalTitle','isAdult','titleType','genres'])

In [141]:
title_basics

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70
2,tt0069049,The Other Side of the Wind,2018.0,NaN,122
3,tt0088751,The Naked Monster,2005.0,NaN,100
4,tt0094859,Chief Zabu,2016.0,NaN,74
...,...,...,...,...,...
82208,tt9914942,Life Without Sara Amat,2019.0,NaN,74
82209,tt9915872,The Last White Witch,2019.0,NaN,97
82210,tt9916170,The Rehearsal,2019.0,NaN,51
82211,tt9916190,Safeguard,2020.0,NaN,95
82212,tt9916362,Coven,2020.0,NaN,92

In [156]:
tmdb_data=tmdb_data[['imdb_id','revenue','budget','certification']]
tmdb_data=tmdb_data.drop(index=0)
tmdb_data.head()

     imdb_id     revenue      budget certification
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG
5  tt0118852         0.0         0.0             R

In [169]:
title_ratings=ratings
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1905
1  tt0000002            5.8       256
2  tt0000003            6.5      1703
3  tt0000004            5.6       168
4  tt0000005            6.2      2518

## Database Creation

In [165]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection_str = "mysql+pymysql://root:root@localhost/movies"

In [166]:
engine = create_engine(connection_str)

In [167]:
create_database(connection_str)

In [168]:
database_exists(connection_str)

True

In [170]:
## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [171]:
title_basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

82213

In [173]:
df_schema_title_genres = {
    "tconst": String(key_len+1), 
    'genre_id':Integer()}

In [174]:
title_genres.to_sql('title_genres',engine,dtype=df_schema_title_genres,
                    if_exists='replace',index=False)

153587

In [175]:
genres.to_sql('genres',engine,
                    if_exists='replace',index=False)

26

In [176]:
df_schema_title_ratings = {
    "tconst": String(key_len+1),
    'averageRating':Float(),
    'numVotes':Float()}

In [177]:
title_ratings.to_sql('title_ratings',engine,dtype=df_schema_title_ratings,
                    if_exists='replace',index=False)

1255994

In [178]:
certification_len = tmdb_data['certification'].fillna('').map(len).max()

In [179]:
df_schema_tmdb_data = {
    "imdb_id": String(key_len+1),
    'revenue':Float(),
    'budget':Float(),
    'certification':String(certification_len+1)}

In [180]:
tmdb_data.to_sql('tmdb_data',engine,dtype=df_schema_tmdb_data,
                    if_exists='replace',index=False)

2491

In [183]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [184]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [185]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [186]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [188]:
q = """select *
from title_basics
limit 5"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0088751,The Naked Monster,2005.0,None,100
4,tt0094859,Chief Zabu,2016.0,None,74

In [189]:
q = """select *
from title_ratings
limit 5"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7    1905.0
1  tt0000002            5.8     256.0
2  tt0000003            6.5    1703.0
3  tt0000004            5.6     168.0
4  tt0000005            6.2    2518.0

In [190]:
q = """select *
from title_genres
limit 5"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         0
1  tt0035423         1
2  tt0035423         2
3  tt0062336         3
4  tt0069049         3

In [191]:
q = """select *
from genres
limit 5"""
pd.read_sql(q, engine)

   genre_id genre_name
0         0     Comedy
1         1    Fantasy
2         2    Romance
3         3      Drama
4         4     Horror

In [192]:
q = """select *
from tmdb_data
limit 5"""
pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0          0         NaN         NaN          None
1  tt0035423  76019000.0  48000000.0         PG-13
2  tt0113026         0.0  10000000.0          None
3  tt0113092         0.0         0.0          None
4  tt0114447         0.0         0.0          None

In [187]:
q = """SHOW TABLES"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data